---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDifferenceNone
source: html/cdb8ea5f-c63a-2319-9dd2-0ac4e435871b.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceNone

The two assemblies being compared are identical

## Syntax (C#)
```csharp
public class AssemblyDifferenceNone : AssemblyDifference
```